{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, null]], "num_parameters": 0}, {"name": "positional_embedding_78", "id": "positional_embedding_78", "class_name": "PositionalEmbedding", "output_shape": [null, null, 256], "num_parameters": 51200}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, null]], "num_parameters": 0}, {"name": "transformer_encoder_37", "id": "transformer_encoder_37", "class_name": "TransformerEncoder", "output_shape": [null, null, 256], "num_parameters": 3155456}, {"name": "model_42", "id": "model_42", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 5362120}], "edges": [["encoder_inputs", "positional_embedding_78"], ["positional_embedding_78", "transformer_encoder_37"], ["decoder_inputs", "model_42"], ["transformer_encoder_37", "model_42"]]}