{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, null]], "num_parameters": 0}, {"name": "positional_embedding_80", "id": "positional_embedding_80", "class_name": "PositionalEmbedding", "output_shape": [null, null, 1], "num_parameters": 200}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, null]], "num_parameters": 0}, {"name": "transformer_encoder_38", "id": "transformer_encoder_38", "class_name": "TransformerEncoder", "output_shape": [null, null, 1], "num_parameters": 6206}, {"name": "model_44", "id": "model_44", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 6865}], "edges": [["encoder_inputs", "positional_embedding_80"], ["positional_embedding_80", "transformer_encoder_38"], ["decoder_inputs", "model_44"], ["transformer_encoder_38", "model_44"]]}