{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, null]], "num_parameters": 0}, {"name": "positional_embedding_22", "id": "positional_embedding_22", "class_name": "PositionalEmbedding", "output_shape": [null, null, 256], "num_parameters": 51200}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, null]], "num_parameters": 0}, {"name": "transformer_encoder_11", "id": "transformer_encoder_11", "class_name": "TransformerEncoder", "output_shape": [null, null, 256], "num_parameters": 3155456}, {"name": "model_20", "id": "model_20", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 5362120}], "edges": [["encoder_inputs", "positional_embedding_22"], ["positional_embedding_22", "transformer_encoder_11"], ["decoder_inputs", "model_20"], ["transformer_encoder_11", "model_20"]]}