{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_66", "id": "positional_embedding_66", "class_name": "PositionalEmbedding", "output_shape": [null, 200, 32], "num_parameters": 1286400}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "transformer_encoder_34", "id": "transformer_encoder_34", "class_name": "TransformerEncoder", "output_shape": [null, 200, 32], "num_parameters": 2279616}, {"name": "model_46", "id": "model_46", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 2767080}], "edges": [["encoder_inputs", "positional_embedding_66"], ["positional_embedding_66", "transformer_encoder_34"], ["decoder_inputs", "model_46"], ["transformer_encoder_34", "model_46"]]}