{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_25", "id": "positional_embedding_25", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_17", "id": "transformer_encoder_17", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 2107248}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_16", "id": "flatten_16", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_17", "id": "model_17", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_25"], ["positional_embedding_25", "transformer_encoder_17"], ["transformer_encoder_17", "flatten_16"], ["decoder_inputs", "model_17"], ["flatten_16", "model_17"]]}