{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_60", "id": "positional_embedding_60", "class_name": "PositionalEmbedding", "output_shape": [null, 200, 256], "num_parameters": 10291200}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "transformer_encoder_31", "id": "transformer_encoder_31", "class_name": "TransformerEncoder", "output_shape": [null, 200, 256], "num_parameters": 2695360}, {"name": "model_40", "id": "model_40", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 25790920}], "edges": [["encoder_inputs", "positional_embedding_60"], ["positional_embedding_60", "transformer_encoder_31"], ["decoder_inputs", "model_40"], ["transformer_encoder_31", "model_40"]]}