{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_31", "id": "positional_embedding_31", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_20", "id": "transformer_encoder_20", "class_name": "TransformerEncoder", "output_shape": [null, 200, 1], "num_parameters": 17350}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_22", "id": "flatten_22", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_23", "id": "model_23", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 28553}], "edges": [["encoder_inputs", "positional_embedding_31"], ["positional_embedding_31", "transformer_encoder_20"], ["transformer_encoder_20", "flatten_22"], ["decoder_inputs", "model_23"], ["flatten_22", "model_23"]]}