{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_78", "id": "positional_embedding_78", "class_name": "PositionalEmbedding", "output_shape": [null, 200, 4], "num_parameters": 160800}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "transformer_encoder_38", "id": "transformer_encoder_38", "class_name": "TransformerEncoder", "output_shape": [null, 200, 4], "num_parameters": 329752}, {"name": "model_54", "id": "model_54", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 340684}], "edges": [["encoder_inputs", "positional_embedding_78"], ["positional_embedding_78", "transformer_encoder_38"], ["decoder_inputs", "model_54"], ["transformer_encoder_38", "model_54"]]}