{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_35", "id": "positional_embedding_35", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_17", "id": "transformer_encoder_17", "class_name": "TransformerEncoder", "output_shape": [null, 200, 1], "num_parameters": 17350}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_34", "id": "flatten_34", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_35", "id": "model_35", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 2984897}], "edges": [["encoder_inputs", "positional_embedding_35"], ["positional_embedding_35", "transformer_encoder_17"], ["transformer_encoder_17", "flatten_34"], ["decoder_inputs", "model_35"], ["flatten_34", "model_35"]]}