{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_29", "id": "positional_embedding_29", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_14", "id": "transformer_encoder_14", "class_name": "TransformerEncoder", "output_shape": [null, 200, 1], "num_parameters": 17350}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_28", "id": "flatten_28", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_29", "id": "model_29", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_29"], ["positional_embedding_29", "transformer_encoder_14"], ["transformer_encoder_14", "flatten_28"], ["decoder_inputs", "model_29"], ["flatten_28", "model_29"]]}