{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_41", "id": "positional_embedding_41", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_20", "id": "transformer_encoder_20", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 1699497}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_40", "id": "flatten_40", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_41", "id": "model_41", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_41"], ["positional_embedding_41", "transformer_encoder_20"], ["transformer_encoder_20", "flatten_40"], ["decoder_inputs", "model_41"], ["flatten_40", "model_41"]]}