{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_15", "id": "positional_embedding_15", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_7", "id": "transformer_encoder_7", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 2107248}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_14", "id": "flatten_14", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_15", "id": "model_15", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_15"], ["positional_embedding_15", "transformer_encoder_7"], ["transformer_encoder_7", "flatten_14"], ["decoder_inputs", "model_15"], ["flatten_14", "model_15"]]}