{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_31", "id": "positional_embedding_31", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_15", "id": "transformer_encoder_15", "class_name": "TransformerEncoder", "output_shape": [null, 200, 1], "num_parameters": 17350}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_30", "id": "flatten_30", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_31", "id": "model_31", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 665353}], "edges": [["encoder_inputs", "positional_embedding_31"], ["positional_embedding_31", "transformer_encoder_15"], ["transformer_encoder_15", "flatten_30"], ["decoder_inputs", "model_31"], ["flatten_30", "model_31"]]}