{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_5", "id": "positional_embedding_5", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_2", "id": "transformer_encoder_2", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 2107248}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_4", "id": "flatten_4", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_5", "id": "model_5", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_5"], ["positional_embedding_5", "transformer_encoder_2"], ["transformer_encoder_2", "flatten_4"], ["decoder_inputs", "model_5"], ["flatten_4", "model_5"]]}