{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_45", "id": "positional_embedding_45", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_22", "id": "transformer_encoder_22", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 2107248}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_44", "id": "flatten_44", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_45", "id": "model_45", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_45"], ["positional_embedding_45", "transformer_encoder_22"], ["transformer_encoder_22", "flatten_44"], ["decoder_inputs", "model_45"], ["flatten_44", "model_45"]]}