{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_11", "id": "positional_embedding_11", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_5", "id": "transformer_encoder_5", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 2107248}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_10", "id": "flatten_10", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_11", "id": "model_11", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_11"], ["positional_embedding_11", "transformer_encoder_5"], ["transformer_encoder_5", "flatten_10"], ["decoder_inputs", "model_11"], ["flatten_10", "model_11"]]}