{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_33", "id": "positional_embedding_33", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_16", "id": "transformer_encoder_16", "class_name": "TransformerEncoder", "output_shape": [null, 200, 1], "num_parameters": 17350}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_32", "id": "flatten_32", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_33", "id": "model_33", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 28553}], "edges": [["encoder_inputs", "positional_embedding_33"], ["positional_embedding_33", "transformer_encoder_16"], ["transformer_encoder_16", "flatten_32"], ["decoder_inputs", "model_33"], ["flatten_32", "model_33"]]}