{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_49", "id": "positional_embedding_49", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_24", "id": "transformer_encoder_24", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 2107248}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_48", "id": "flatten_48", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_49", "id": "model_49", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_49"], ["positional_embedding_49", "transformer_encoder_24"], ["transformer_encoder_24", "flatten_48"], ["decoder_inputs", "model_49"], ["flatten_48", "model_49"]]}