{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_37", "id": "positional_embedding_37", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_18", "id": "transformer_encoder_18", "class_name": "TransformerEncoder", "output_shape": [null, 200, 1], "num_parameters": 17350}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_36", "id": "flatten_36", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_37", "id": "model_37", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_37"], ["positional_embedding_37", "transformer_encoder_18"], ["transformer_encoder_18", "flatten_36"], ["decoder_inputs", "model_37"], ["flatten_36", "model_37"]]}