{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_47", "id": "positional_embedding_47", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_23", "id": "transformer_encoder_23", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 2107248}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_46", "id": "flatten_46", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_47", "id": "model_47", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_47"], ["positional_embedding_47", "transformer_encoder_23"], ["transformer_encoder_23", "flatten_46"], ["decoder_inputs", "model_47"], ["flatten_46", "model_47"]]}