{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding", "id": "positional_embedding", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder", "id": "transformer_encoder", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 2107248}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten", "id": "flatten", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_1", "id": "model_1", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding"], ["positional_embedding", "transformer_encoder"], ["transformer_encoder", "flatten"], ["decoder_inputs", "model_1"], ["flatten", "model_1"]]}