{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_7", "id": "positional_embedding_7", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_3", "id": "transformer_encoder_3", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 2107248}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_6", "id": "flatten_6", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_7", "id": "model_7", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_7"], ["positional_embedding_7", "transformer_encoder_3"], ["transformer_encoder_3", "flatten_6"], ["decoder_inputs", "model_7"], ["flatten_6", "model_7"]]}