{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_43", "id": "positional_embedding_43", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_21", "id": "transformer_encoder_21", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 1699497}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_42", "id": "flatten_42", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_43", "id": "model_43", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_43"], ["positional_embedding_43", "transformer_encoder_21"], ["transformer_encoder_21", "flatten_42"], ["decoder_inputs", "model_43"], ["flatten_42", "model_43"]]}