{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_102", "id": "positional_embedding_102", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_56", "id": "transformer_encoder_56", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 2107248}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_21", "id": "flatten_21", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_56", "id": "model_56", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_102"], ["positional_embedding_102", "transformer_encoder_56"], ["transformer_encoder_56", "flatten_21"], ["decoder_inputs", "model_56"], ["flatten_21", "model_56"]]}