{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_73", "id": "positional_embedding_73", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_44", "id": "transformer_encoder_44", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 2107248}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_8", "id": "flatten_8", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_43", "id": "model_43", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_73"], ["positional_embedding_73", "transformer_encoder_44"], ["transformer_encoder_44", "flatten_8"], ["decoder_inputs", "model_43"], ["flatten_8", "model_43"]]}