{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[64, 200]], "num_parameters": 0}, {"name": "positional_embedding_130", "id": "positional_embedding_130", "class_name": "PositionalEmbedding", "output_shape": [64, 200, 1], "num_parameters": 200}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[64, 200]], "num_parameters": 0}, {"name": "transformer_encoder_69", "id": "transformer_encoder_69", "class_name": "TransformerEncoder", "output_shape": [64, 200, 1], "num_parameters": 6206}, {"name": "model_70", "id": "model_70", "class_name": "Functional", "output_shape": [64, 200], "num_parameters": 6465}], "edges": [["encoder_inputs", "positional_embedding_130"], ["positional_embedding_130", "transformer_encoder_69"], ["decoder_inputs", "model_70"], ["transformer_encoder_69", "model_70"]]}