{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_134", "id": "positional_embedding_134", "class_name": "PositionalEmbedding", "output_shape": [null, 200, 1], "num_parameters": 200}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "transformer_encoder_71", "id": "transformer_encoder_71", "class_name": "TransformerEncoder", "output_shape": [null, 200, 1], "num_parameters": 6206}, {"name": "model_74", "id": "model_74", "class_name": "Functional", "output_shape": [64, 200], "num_parameters": 6465}], "edges": [["encoder_inputs", "positional_embedding_134"], ["positional_embedding_134", "transformer_encoder_71"], ["decoder_inputs", "model_74"], ["transformer_encoder_71", "model_74"]]}