{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_184", "id": "positional_embedding_184", "class_name": "PositionalEmbedding", "output_shape": [null, 200, 1], "num_parameters": 200}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "transformer_encoder_96", "id": "transformer_encoder_96", "class_name": "TransformerEncoder", "output_shape": [null, 200, 1], "num_parameters": 6206}, {"name": "model_102", "id": "model_102", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 6465}], "edges": [["encoder_inputs", "positional_embedding_184"], ["positional_embedding_184", "transformer_encoder_96"], ["decoder_inputs", "model_102"], ["transformer_encoder_96", "model_102"]]}