{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_136", "id": "positional_embedding_136", "class_name": "PositionalEmbedding", "output_shape": [null, 200, 1], "num_parameters": 200}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "transformer_encoder_72", "id": "transformer_encoder_72", "class_name": "TransformerEncoder", "output_shape": [null, 200, 1], "num_parameters": 6206}, {"name": "model_76", "id": "model_76", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 6465}], "edges": [["encoder_inputs", "positional_embedding_136"], ["positional_embedding_136", "transformer_encoder_72"], ["decoder_inputs", "model_76"], ["transformer_encoder_72", "model_76"]]}