{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_132", "id": "positional_embedding_132", "class_name": "PositionalEmbedding", "output_shape": [null, 200, 1], "num_parameters": 200}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "transformer_encoder_70", "id": "transformer_encoder_70", "class_name": "TransformerEncoder", "output_shape": [null, 200, 1], "num_parameters": 6206}, {"name": "model_72", "id": "model_72", "class_name": "Functional", "output_shape": [64, 200], "num_parameters": 6465}], "edges": [["encoder_inputs", "positional_embedding_132"], ["positional_embedding_132", "transformer_encoder_70"], ["decoder_inputs", "model_72"], ["transformer_encoder_70", "model_72"]]}