{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, null]], "num_parameters": 0}, {"name": "positional_embedding_2", "id": "positional_embedding_2", "class_name": "PositionalEmbedding", "output_shape": [null, null, 1], "num_parameters": 200}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, null]], "num_parameters": 0}, {"name": "transformer_encoder_1", "id": "transformer_encoder_1", "class_name": "TransformerEncoder", "output_shape": [null, null, 1], "num_parameters": 6206}, {"name": "model_3", "id": "model_3", "class_name": "Functional", "output_shape": [null, null], "num_parameters": 6465}], "edges": [["encoder_inputs", "positional_embedding_2"], ["positional_embedding_2", "transformer_encoder_1"], ["decoder_inputs", "model_3"], ["transformer_encoder_1", "model_3"]]}