{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, null]], "num_parameters": 0}, {"name": "positional_embedding", "id": "positional_embedding", "class_name": "PositionalEmbedding", "output_shape": [null, null, 1], "num_parameters": 200}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, null]], "num_parameters": 0}, {"name": "transformer_encoder", "id": "transformer_encoder", "class_name": "TransformerEncoder", "output_shape": [null, null, 1], "num_parameters": 6206}, {"name": "model_1", "id": "model_1", "class_name": "Functional", "output_shape": [null, null], "num_parameters": 6465}], "edges": [["encoder_inputs", "positional_embedding"], ["positional_embedding", "transformer_encoder"], ["decoder_inputs", "model_1"], ["transformer_encoder", "model_1"]]}