{"format": "keras", "nodes": [{"name": "encoder_inputs", "id": "encoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "positional_embedding_2", "id": "positional_embedding_2", "class_name": "PositionalEmbedding", "output_shape": [null, 200], "num_parameters": 0}, {"name": "transformer_encoder_1", "id": "transformer_encoder_1", "class_name": "TransformerEncoder", "output_shape": [null, 1, 200], "num_parameters": 2107248}, {"name": "decoder_inputs", "id": "decoder_inputs", "class_name": "InputLayer", "output_shape": [[null, 200]], "num_parameters": 0}, {"name": "flatten_2", "id": "flatten_2", "class_name": "Flatten", "output_shape": [null, 200], "num_parameters": 0}, {"name": "model_3", "id": "model_3", "class_name": "Functional", "output_shape": [null, 200], "num_parameters": 3392648}], "edges": [["encoder_inputs", "positional_embedding_2"], ["positional_embedding_2", "transformer_encoder_1"], ["transformer_encoder_1", "flatten_2"], ["decoder_inputs", "model_3"], ["flatten_2", "model_3"]]}